routers_controllers/app/controllers/artworks_controller.rb

  def index
    artworks_owned = Artwork.find_by(artist_id: params[:user_id])

    if artworks_owned.nil?
      render json: Artwork.all
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 103], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"

  def create
    artwork = Artwork.new(artwork_params)

    if artwork.save
---
INSERT INTO "artworks" ("artist_id", "title", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist_id", 102], ["title", "Mona_Lisa"], ["image_url", "mona_lisa.png"], ["created_at", "2020-02-27 16:32:36.304556"], ["updated_at", "2020-02-27 16:32:36.304556"]]

  def update
    artwork = Artwork.find(params[:id])
    debugger
    if artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "Starry_Nights"], ["image_url", "starry_nights.png"], ["updated_at", "2020-02-27 16:45:35.843098"], ["id", 51]]