routers_controllers/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."author_id" = $1 AND "comments"."artwork_id" IS NULL LIMIT $2  [["author_id", 111], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."author_id" = $1 LIMIT $2  [["author_id", 111], ["LIMIT", 1]]
---
  def index
    comments = Comment.find_by(author_id: params[:user_id], artwork_id: params[:artwork_id])

    if comments.nil?
      comments = Comment.find_by(author_id: params[:user_id])