routers_controllers/app/controllers/users_controller.rb

  def index
    users = User.find_by(username: params[:name])
    # if something LIKE 'localhost:3000/users/?%'
    if users.nil?
      render json: User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Joe"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
    # debugger
    user = User.new(params.require(:user).permit(:name, :email))
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Johnny"], ["email", "johnny@appacademy.io"], ["created_at", "2020-02-26 20:14:30.555326"], ["updated_at", "2020-02-26 20:14:30.555326"]]